; File Joiner (www.igorware.com/file-joiner)

[translation]
vers=2.1.3
laid=0x0401
lang=عربي (Arabic)
name=Majed Alotaibi (twitter.com/Majid_KSA)
date=2012-02-29

[controls]
000=آلي
001=إضافة &ملفات
002=إضافة مجلد
003=&إزالة
004=إزالةالكل
005=استعراض
006=! (إلحاق بالملف الأول في القائمة (المستخدمون المتقدمون فقط
007=هاش
008=مسح
009=عند الانتهاء:
010=فتح الملف الناتج عند الإنتهاء
011=فتح مجلد الناتج عند الإنتهاء
012=حذف عند الإنتهاء
013=خروج عند الإنتهاء

[about]
000=حول %s
001=موافق

[list_column]
000=المسار
001=الحجم
002=الحالة

[list_status_cat]
000=موافق
001=تحذير
002=خطأ

[list_status]
000=موافق
001=تحذير: عدد ترتيبي غير متوقع
002=تحذير: عدم تطابق حجم الملف مع الملف الأول
003=تحذير: حجم آخر ملف أكبر من الملفات السابقة
004=خطأ: لا يمكن فتح الملف للكتابة!
005=خطأ: لا يمكن فتح الملف للقراءة!

[list_tooltip]
000=قائمة بملفات الإدخال
001=المسار:\t %s\r\nالحجم:\t %s\r\nالترتيب:\t %d\r\nالحالة:\t %s

[join_button]
000=إ&يقاف
001=دمج&

[settings]
000=إعدادات
001=اختبارات
002=اختبار للأجزاء المفقودة عند التحميل
003=اختبار اتساق حجم الملفات عند التحميل
004=اختبار للملفات المفقودة
005=اختبار اتساق حجم الملفات
006=الملفات
007=(الفرز باستخدام الرقم الأخير فقط في مسار الملف(أسرع
008=قم بإزالة كافة العناصر من القائمة بعد الدمج 
009=تعطيل التحميل التلقائي للأجزاء
010=استدعاء ذاتي للمجلدات الفرعية
011=عام
012=تذكر موضع النافذة
013=استخدام "سلة المحذوفات" عند حذف الأجزاء
014=مسار الناتج الافتراضي
015=نفس مجلد الإدخال
016=مسار مخصص
017=حفظ
018=إلغاء الأمر
019=

[menu]
000=خصائص
001=دائما في القمة\tCtrl + T(&T)
002=(اقتران مع ملفات .001 (غير محمول
003=تعطيل &الهاش
004=قم بإزالة كافة العناصر من القائمة بعد الدمج
005=إعدادات

006=اللغة

007=مساعدة
008=تعليمات على الإنترنت&
009=صفحة ويب&
010=تعريب ماجد العتيبي
011=

[menu_popup]
000=
001=
002=
003=&إزالة
004=إزالةالكل

[messages]
001=لا يمكن إنشاء مؤشر ترابط حروف
002=عملية الدمج قيد التقدم، هل تريد حقا الخروج (غير مستحسن)؟
003=جاهز
004=يتم الدمج...
005=  عملية الدمج قيد التقدم!
006=تم دمج الملف بنجاح!

007=لديك ملف واحد فقط في القائمة!
008=لم يتم تحديد أية ملفات للنقل
009=قائمة الملفات فارغة لا توجد ملفات لدمجها
010=لا يمكن فتح الملف!
011=لا يمكن إنشاء ملف الناتج المعين!
012=فشلت عملية كتابة الملف! مساحة القرص منخفضة؟
013=الملفات المضافة:% d
014=ملفات محملة آلياً:% d
015=ملف الناتج موجود بالفعل. هل ترغب في الكتابة فوق الملف؟
016=لم يتم تحديد مسار ملف الناتج

017=اختبار الأجزاء المفقودة
018=يوجد  %d أجزاء مفقودة بالتراتيب: %s.
019=هناك أكثر من %d أجزاء مفقودة بالتراتيب التالية: %s.
020=اختبار حجم الأجزاء
021=يبدو أن عدد  %d لديها أحجام مختلفة عن الجزء الأول، ربما يعني هذا أنها تالفة أو لا تنتمي لنفس المجموعة. تراتيب الأجزاء ذات الحجم المختلف هي: %s.
022=يبدو أن الجزء الأخير ليس لديه حجم أصغر ، ربما يكون هذا علامة على  أن الجزء الأخير مفقود ، لكن لا يشترط أن يكون هذا صحيحاً دائماً
023=\n\nهل أنت متأكد من أنك تريد مواصلة عمليةالدمج؟
024=مسار مخصص: "% s"
025=الناتج

[tooltips]
000=* المستخدمون المتقدمون فقط *\r\nإلحاق كل الملفات بالملف الأول في القائمة.\r\nجيد للسرعة، و لكن سيء اذا أخطأت في ترتيب الملفات في القائمة.
001=نقل الملفات المحددة لأعلى في القائمة
002=نقل الملفات المحددة إلى أسفل القائمة
003=المسار حيث سيتم حفظ ملف الناتج
004=الاستعراض بحثاً عن موقع لحفظ ملف الناتج
005=دمج الملفات في القائمة
006=الحالة
007=إضافة ملفات إلى القائمة
008=إضافة كافة الملفات من المجلد
009=إزالة العناصر المحددة من القائمة
010=قم بإزالة كافة العناصر من القائمة
011=فرز العناصر في قائمة
012=تبديل الفرز التلقائي
013=CRC32 هاش
014=CRC32 تبديل حساب هاش
015=MD5 هاش
016=MD5 تبديل حساب هاش
017=مسح قيمة الهاش
018=حذف كل الأجزاء من القرص الصلب عند الإنتهاء - فقط عند الدمج الناجح
019=خروج عند الإنتهاء - فقط عند الدمج الناجح
020=فتح الملف الناتج عند الإنتهاء - فقط عند الدمج الناجح
021=فتح مجلد الناتج - فقط عند الدمج الناجح

[updater]
000=
001=
002=
